Рабочая.Задачи2/src/DataProcessors/ЦБР_АРМПрикрепленияРеализаций/ЦБР_АРМПрикрепленияРеализаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЦБР_АРМПрикрепленияРеализаций</name>
</mdclass:DataProcessor>

Рабочая.Задачи2/src/AccumulationRegisters/ЦБР_СогласованоЗакрытоЧасов/ЦБР_СогласованоЗакрытоЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЦБР_СогласованоЗакрытоЧасов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Закрыто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатусЗадачиБезРеализации</name>
    <type>
      <types>EnumRef.ЦБР_СтатусыЗадачиБезРеализации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодразделениеИсполнителя</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеПостановщика</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Рабочая.Задачи2/src/AccumulationRegisters/ЦБР_ЧасыКлиентов/ЦБР_ЧасыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЦБР_ЧасыКлиентов</name>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Акт</name>
    <type>
      <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Рабочая.Задачи2/src/Enums/ЦБР_ВидыЧасовПоЗадачам/ЦБР_ВидыЧасовПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_ВидыЧасовПоЗадачам</name>
  <enumValues>
    <name>ИТС</name>
  </enumValues>
  <enumValues>
    <name>Установка</name>
  </enumValues>
  <enumValues>
    <name>Платные</name>
  </enumValues>
  <enumValues>
    <name>Бесплатные</name>
  </enumValues>
  <enumValues>
    <name>Демо</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Documents/ЦБР_Задание/ЦБР_Задание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЦБР_Задание</name>
  <registerRecords>AccumulationRegister.ЦБР_ЧасыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_СогласованоЗакрытоЧасов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_КоличествоЧасовСотрудниковПоЗадачам</registerRecords>
  <attributes>
    <name>Аналитик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПереписка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПрикрепленныйФайл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаСчетКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоментарийКСогласованию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетГарантииОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаданияВУровне</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДополнительное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоФакту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущееЗадание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </attributes>
  <attributes>
    <name>Принято</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РамочнаяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗадачу</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСтруктуру</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОценкиЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипОценкиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалосьРешитьПриПодключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыСогласованы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоУточнениеТребований</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланСтарый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Предшественники</name>
    <attributes>
      <name>Предшественник</name>
      <type>
        <types>DocumentRef.ЦБР_Задание</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗависимости</name>
      <type>
        <types>EnumRef.ЦБР_ТипЗависимостиЗаданий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭффективныеЧасы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеКалендаря</name>
      <type>
        <types>CatalogRef.ЦБР_ЗаписиРабочегоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧасыЗП</name>
    <attributes>
      <name>ПериодЗП</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаСчетКомпании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Зачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Рабочая.Задачи2/src/DataProcessors/ЦБР_АРМПрикрепленияРеализаций/Forms/ФормаНовая/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("КлиентОтбора") Тогда
		КлиентОтбор = Параметры.КлиентОтбора;
	КонецЕсли;
	
	Элементы.ДеревоЗадачУстановитьЗаСчетКомпании.Видимость = РольДоступна("ЦБР_ЧасыЗаСчетКомпании");
	
	Если Не РольДоступна("ЦБР_РуководительКО") И Не РольДоступна("ПолныеПрава") Тогда
		Менеджер = ПараметрыСеанса.ТекущийПользователь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Менеджер", "Доступность", Ложь);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодРегистрации = НачалоМесяца(ТекущаяДата());
	ПериодРегистрацииПредставление = ОбщегоНазначенияУТКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации);
	ОбновитьДеревоЗадач();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы 

&НаКлиенте
Процедура ДеревоЗадачПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ДеревоЗадач.ТекущиеДанные;
	ЧасовВыбрано = 0;
	Если ТекДанные = Неопределено Тогда
		ДеревоЗадачПриАктивизацииСтрокиНаСервере(Неопределено);
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.Задание = ПредопределенноеЗначение("Документ.ЦБР_Задание.ПустаяСсылка") Тогда //выбрана ЗАДАЧА
		ДеревоЗадачПриАктивизацииСтрокиНаСервере(ТекДанные.Родитель, Истина);	
	Иначе
		ДеревоЗадачПриАктивизацииСтрокиНаСервере(ТекДанные.Задание);
	КонецЕсли;
	
		
КонецПроцедуры
                                  
&НаКлиенте
Процедура ПериодРегистрацииПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	Оповещение = Новый ОписаниеОповещения("ПериодРегистрацииПредставлениеНачалоВыбораЗавершение", ЭтаФорма);
	ОбщегоНазначенияУТКлиент.НачалоВыбораПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодРегистрации, ЭтаФорма, Оповещение); 

	ОбновитьДеревоЗадач();
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПредставлениеНачалоВыбораЗавершение(ВыбранноеЗначение, ДопПараметры) Экспорт
	ПериодРегистрации = ВыбранноеЗначение; 
	ПериодРегистрацииПредставление = ОбщегоНазначенияУТКлиент.ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации);	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПредставлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ОбщегоНазначенияУТКлиент.РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, ПериодРегистрации, ПериодРегистрацииПредставление);

	ОбновитьДеревоЗадач();	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЭлементовОбщий(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборЭлементов(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВыборЭлементов(Элемент)
	ТекСтрока = Элемент.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда
		Если Элемент.ТекущийЭлемент.Имя = "ДеревоЗадачЗадание" Тогда		
			Отправка = Новый Структура;
			Отправка.Вставить("Ключ", ТекСтрока.Задание);
			ОткрытьФорму("Документ.ЦБР_Задание.Форма.ФормаДокумента", Отправка); 
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ДеревоЗадачРодитель" Тогда		
			Отправка = Новый Структура;
			Отправка.Вставить("Ключ", ТекСтрока.Родитель);
			ОткрытьФорму("Справочник.ЦБР_Задача.Форма.ФормаЭлемента", Отправка); 
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТаблицаРеализацийРеализация" Тогда		
			Отправка = Новый Структура;
			Отправка.Вставить("Ключ", ТекСтрока.Реализация);
			ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента", Отправка);
		КонецЕсли;		
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеализацийВыбранаПриИзменении(Элемент)
	ТекДанныеЗадач = Элементы.ДеревоЗадач.ТекущиеДанные;
	ТекДанные = Элементы.ТаблицаРеализаций.ТекущиеДанные;
	ЧасовВыбрано = ?(ТекДанные.Выбрана, ЧасовВыбрано + ТекДанные.ЧасыОстаток, ЧасовВыбрано - ТекДанные.ЧасыОстаток);
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДерева

&НаСервере
Процедура ЗаполнитьДеревоНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.Регистратор КАК Задание,
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.Исполнитель КАК Исполнитель,
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.Задача КАК Родитель,
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.ВидЧаса КАК ВидЧаса,  
	|	НАЧАЛОПЕРИОДА(ЦБР_СогласованоЗакрытоЧасовОбороты.Период, МЕСЯЦ) КАК ПериодЗП,  
	|   СУММА(ЦБР_СогласованоЗакрытоЧасовОбороты.СогласованоОборот - ЦБР_СогласованоЗакрытоЧасовОбороты.ЗакрытоОборот) КАК Эффективные,
	//|	СУММА(ВЫБОР
	//|			КОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.ВидЧаса = ЗНАЧЕНИЕ(Перечисление.ЦБР_ВидыЧасовПоЗадачам.Платные)
	//|				ТОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.СогласованоОборот - ЦБР_СогласованоЗакрытоЧасовОбороты.ЗакрытоОборот
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК Эффективные,
	|	СУММА(ВЫБОР
	|			КОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.ВидЧаса = ЗНАЧЕНИЕ(Перечисление.ЦБР_ВидыЧасовПоЗадачам.Бесплатные)
	|				ТОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.СогласованоОборот - ЦБР_СогласованоЗакрытоЧасовОбороты.ЗакрытоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Бесплатные,
	|	СУММА(ВЫБОР
	|		КОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.ВидЧаса = ЗНАЧЕНИЕ(Перечисление.ЦБР_ВидыЧасовПоЗадачам.ИТС)
	|			ТОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.СогласованоОборот - ЦБР_СогласованоЗакрытоЧасовОбороты.ЗакрытоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ИТС,
	|	СУММА(ВЫБОР
	|		КОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.ВидЧаса = ЗНАЧЕНИЕ(Перечисление.ЦБР_ВидыЧасовПоЗадачам.Установка)
	|			ТОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.СогласованоОборот - ЦБР_СогласованоЗакрытоЧасовОбороты.ЗакрытоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Установочные,
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.Задача.Заказчик КАК Заказчик
	|ИЗ
	|	РегистрНакопления.ЦБР_СогласованоЗакрытоЧасов.Обороты(, &КонецПериода, Регистратор, ВидЧаса <> &ВидЧасаДемо) КАК ЦБР_СогласованоЗакрытоЧасовОбороты
	|ГДЕ
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.СогласованоОборот > ЦБР_СогласованоЗакрытоЧасовОбороты.ЗакрытоОборот
	|	И ЦБР_СогласованоЗакрытоЧасовОбороты.Задача.Заказчик = &Заказчик 
	|	И ЦБР_СогласованоЗакрытоЧасовОбороты.Задача.Постановщик = &Менеджер
	|	И ЦБР_СогласованоЗакрытоЧасовОбороты.ВидЧаса = &ВидЧаса
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.Регистратор,
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.Исполнитель,
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.Задача,
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.ВидЧаса,
    |   НАЧАЛОПЕРИОДА(ЦБР_СогласованоЗакрытоЧасовОбороты.Период, МЕСЯЦ),
    //|	ВЫБОР
	//|		КОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.ВидЧаса = ЗНАЧЕНИЕ(Перечисление.ЦБР_ВидыЧасовПоЗадачам.ИТС)
	//|			ТОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.СогласованоОборот - ЦБР_СогласованоЗакрытоЧасовОбороты.ЗакрытоОборот
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.ВидЧаса = ЗНАЧЕНИЕ(Перечисление.ЦБР_ВидыЧасовПоЗадачам.Установка)
	//|			ТОГДА ЦБР_СогласованоЗакрытоЧасовОбороты.СогласованоОборот - ЦБР_СогласованоЗакрытоЧасовОбороты.ЗакрытоОборот
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	|	ЦБР_СогласованоЗакрытоЧасовОбороты.Задача.Заказчик
	|ИТОГИ ПО
	|	Родитель";
	
	Запрос.УстановитьПараметр("ВидЧасаДемо", Перечисления.ЦБР_ВидыЧасовПоЗадачам.Демо);
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецМесяца(ПериодРегистрации),ВидГраницы.Включая));
	
	Если НЕ ЗначениеЗаполнено(КлиентОтбор) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЦБР_СогласованоЗакрытоЧасовОбороты.Задача.Заказчик = &Заказчик" , "");
	Иначе
		Запрос.УстановитьПараметр("Заказчик", КлиентОтбор);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Менеджер) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЦБР_СогласованоЗакрытоЧасовОбороты.Задача.Постановщик = &Менеджер" , "");
	Иначе
		Запрос.УстановитьПараметр("Менеджер", Менеджер);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидЧаса) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЦБР_СогласованоЗакрытоЧасовОбороты.ВидЧаса = &ВидЧаса" , "");
	Иначе
		Запрос.УстановитьПараметр("ВидЧаса", ВидЧаса);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоРодитель = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	ЗначениеВРеквизитФормы(ДеревоРодитель, "ДеревоЗадач");	
	
	ДеревоЗадач.ПолучитьЭлементы();	 
	
КонецПроцедуры

&НаСервере
Процедура ДеревоЗадачПриАктивизацииСтрокиНаСервере(ПараметрЗадачи, ЭтоРодитель = Ложь)
	
	Если ПараметрЗадачи = Неопределено Тогда
		ОбновитьТаблицуРеализаций();
		Возврат;
	КонецЕсли;
	
	Если ЭтоРодитель Тогда
		ЗаказчикПараметр = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрЗадачи, "Заказчик");	
	Иначе		
		ЗадачаПараметр = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрЗадачи, "СсылкаНаЗадачу");
		ЗаказчикПараметр = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗадачаПараметр, "Заказчик");
	КонецЕсли; 
	
	ОбновитьТаблицуРеализаций(ЗаказчикПараметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоЗадач(Команда = Неопределено)
	ЗаполнитьДеревоНаСервере();
	РаскрытьДеревоЗадач();
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьДеревоЗадач() 
	
	КоллекцияЭлементовДерева = ДеревоЗадач.ПолучитьЭлементы();
	
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Элементы.ДеревоЗадач.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаспределениеЧасов

&НаКлиенте
Процедура ПрикрепитьВыделенныеРеализацииКЗаданию(Команда)  //_Note: добавить контроль выделенных часов у задач и заданий!!
	
	Если ЧасовВыбрано = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбраны реализации для прикрепления!");
		Возврат;
	КонецЕсли;
	
	//++ проверка выделенных задач на одного контрагента
	//ОдинКонтрагент = Истина; 
	//СтароеЗаданиеЗаказчик = Неопределено;
	//Для Каждого Элемент Из Элементы.ДеревоЗадач.ВыделенныеСтроки Цикл
	//	
	//	ТекущаяСтрока = Элементы.ДеревоЗадач.ДанныеСтроки(Элемент);
	//	
	//	Если СтароеЗаданиеЗаказчик = Неопределено Тогда
	//		СтароеЗаданиеЗаказчик = ТекущаяСтрока.Заказчик;
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если СтароеЗаданиеЗаказчик <> ТекущаяСтрока.Заказчик Тогда
	//		ОдинКонтрагент = Ложь;
	//		Прервать;
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	//
	//Если НЕ ОдинКонтрагент Тогда
	//	ОбщегоНазначенияКлиент.СообщитьПользователю("Задачи и задания должны быть от одного заказчика!");
	//	Возврат;
	//КонецЕсли;
    //-- проверка выделенных задач
   
   
	//++распределение задач
	////для нескольких строк	
	//Для Каждого Элемент Из Элементы.ДеревоЗадач.ВыделенныеСтроки Цикл  
	//	
	//	ТекущаяСтрока = Элементы.ДеревоЗадач.ДанныеСтроки(Элемент);
	//	
	//	//++ распределение с проверкой на одновременно выделенного родителя и подчиненного элемента
	//	Если ТекущаяСтрока.Задание = ПредопределенноеЗначение("Документ.ЦБР_Задание.ПустаяСсылка") Тогда //выбран родитель
	//		РодительДляПроверки = ТекущаяСтрока.Родитель;
	//		ПодчиненныеСтрокиРодителя = ТекущаяСтрока.ПолучитьЭлементы();
	//		Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтрокиРодителя Цикл 
	//			ПрикрепитьВыделенныеРеализацииКЗаданиюНаСервере(ПодчиненнаяСтрока.Задание);
	//		КонецЦикла;
	//	
	//	ИначеЕсли ТекущаяСтрока.Родитель = РодительДляПроверки Тогда // выбрано подчиненное задание уже выбранного родителя
	//		Продолжить;
	//	Иначе // выбрано подчиненное задание (стандартная ситуация)
	//		ПрикрепитьВыделенныеРеализацииКЗаданиюНаСервере(ТекущаяСтрока.Задание); 
	//	КонецЕсли;
	//	//-- распределение с проверкой
	//КонецЦикла;
	//       
	
	
	//Для одной строки 
	ТекущаяСтрока = Элементы.ДеревоЗадач.ТекущиеДанные;
	
	Если ТекущаяСтрока.Задание = ПредопределенноеЗначение("Документ.ЦБР_Задание.ПустаяСсылка") Тогда //выбран родитель
		РодительДляПроверки = ТекущаяСтрока.Родитель;
		ПодчиненныеСтрокиРодителя = ТекущаяСтрока.ПолучитьЭлементы();
		Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтрокиРодителя Цикл 
			СтруктураПараметры = Новый Структура("ТекущееЗадание,ВидЧаса,ОсталосьРаспределить,ПериодЗП", ПодчиненнаяСтрока.Задание, ПодчиненнаяСтрока.ВидЧаса, ПодчиненнаяСтрока.Эффективные, ПодчиненнаяСтрока.ПериодЗП);
			ЦБР_ПрикрепитьВыделенныеРеализацииКЗаданиюНаСервере(СтруктураПараметры);
		КонецЦикла;
	Иначе //выбрано задание 
		СтруктураПараметры = Новый Структура("ТекущееЗадание,ВидЧаса,ОсталосьРаспределить,ПериодЗП", ТекущаяСтрока.Задание, ТекущаяСтрока.ВидЧаса, ТекущаяСтрока.Эффективные, ТекущаяСтрока.ПериодЗП);
		ЦБР_ПрикрепитьВыделенныеРеализацииКЗаданиюНаСервере(СтруктураПараметры); 
	КонецЕсли;  
	
	//ТаблицаРеализаций.Очистить();
	ОбновитьДеревоЗадач();
	ОбновитьТаблицуРеализаций();
	
КонецПроцедуры 

&НаСервере
Процедура ПрикрепитьВыделенныеРеализацииКЗаданиюНаСервере(ТекущееЗадание) 
	
	Строки        = ТаблицаРеализаций.НайтиСтроки(Новый Структура("Выбрана",Истина));
	ОбъектЗадания = ТекущееЗадание.ПолучитьОбъект();	
	
	Индекс               = 0; 
	ОсталосьРаспределить = 0;
	МожноРаспределить    = 0;   
	
	Для Каждого Строка Из Строки Цикл 
		Если Строка.ЧасыОстаток = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если Индекс = ОбъектЗадания.ЭффективныеЧасы.Количество() Тогда
			Прервать;
		КонецЕсли;
		РаспределитьЧасы(ОбъектЗадания.ЭффективныеЧасы, Строка, Индекс, ОсталосьРаспределить, МожноРаспределить);	
		Строка.ЧасыОстаток = МожноРаспределить;
	КонецЦикла;   
	
	ОбъектЗадания.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаСервере
Процедура ЦБР_ПрикрепитьВыделенныеРеализацииКЗаданиюНаСервере(СтруктураПараметры) 
	
	Строки        = ТаблицаРеализаций.НайтиСтроки(Новый Структура("Выбрана",Истина));
	ОбъектЗадания = СтруктураПараметры.ТекущееЗадание.ПолучитьОбъект();	
	
	Индекс               = 0; 
	МожноРаспределить    = 0;   
	
	Для Каждого Строка Из Строки Цикл 
		
		Если Строка.ЧасыОстаток = 0 Тогда
			Продолжить;
		КонецЕсли;  
		
		Если Строка.ВидЧаса <> СтруктураПараметры.ВидЧаса Тогда
			Продолжить;
		КонецЕсли;  
		
		Если Индекс = ОбъектЗадания.ЧасыЗП.Количество() Тогда
			Прервать;
		КонецЕсли;
		
		ЦБР_РаспределитьЧасы(ОбъектЗадания.ЧасыЗП, Строка, Индекс, СтруктураПараметры, МожноРаспределить);	
		
		Строка.ЧасыОстаток = МожноРаспределить;
	КонецЦикла;   
	
	ОбъектЗадания.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЦБР_РаспределитьЧасы(ЭффективныеЧасы, СтрокаРеализация, Индекс, СтруктураПараметры, МожноРаспределить);
	
	Если СтруктураПараметры.ОсталосьРаспределить = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	СтрокаРаспределения = ЭффективныеЧасы[Индекс];  
	
	Если СтрокаРаспределения.ВидЧаса <> СтрокаРеализация.ВидЧаса Тогда
		Возврат;
	КонецЕсли;	
	
	Если СтрокаРаспределения.ПериодЗП <> СтруктураПараметры.ПериодЗП Тогда
		Индекс = Индекс+1;
		ЦБР_РаспределитьЧасы(ЭффективныеЧасы, СтрокаРеализация, Индекс, СтруктураПараметры, МожноРаспределить);
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СтрокаРаспределения.Реализация) Или СтрокаРаспределения.ЗаСчетКомпании Или СтрокаРаспределения.Зачтено Тогда
		Индекс = Индекс+1;
		ЦБР_РаспределитьЧасы(ЭффективныеЧасы, СтрокаРеализация, Индекс, СтруктураПараметры, МожноРаспределить);
		Возврат;
	КонецЕсли;
	
	ЭффективныеЧасыДо = СтрокаРаспределения.ЭффективныеЧасы;
	СтрокаРаспределения.ЭффективныеЧасы = ?(?(МожноРаспределить>0, МожноРаспределить, СтрокаРеализация.ЧасыОстаток) >= СтруктураПараметры.ОсталосьРаспределить, СтруктураПараметры.ОсталосьРаспределить, ?(МожноРаспределить>0, МожноРаспределить, СтрокаРеализация.ЧасыОстаток));
	СтруктураПараметры.ОсталосьРаспределить = СтруктураПараметры.ОсталосьРаспределить - СтрокаРаспределения.ЭффективныеЧасы;
	ОсталисьЭффективныеЧасы = ЭффективныеЧасыДо - СтрокаРаспределения.ЭффективныеЧасы; 
	МожноРаспределить = ?(МожноРаспределить>0,МожноРаспределить,СтрокаРеализация.ЧасыОстаток) - СтрокаРаспределения.ЭффективныеЧасы;

	СтрокаРаспределения.Реализация = СтрокаРеализация.Реализация;

	Индекс = Индекс+1;  
		
	Если СтруктураПараметры.ОсталосьРаспределить > 0 И МожноРаспределить > 0 Тогда
		НоваяСтрока = ЭффективныеЧасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭффективныеЧасы[Индекс-1]);
		НоваяСтрока.ЭффективныеЧасы = СтруктураПараметры.ОсталосьРаспределить;
		ЭффективныеЧасы.Сдвинуть(НоваяСтрока, -1);
		Возврат;
    ИначеЕсли ОсталисьЭффективныеЧасы > 0 И МожноРаспределить > 0 Тогда
		НоваяСтрока = ЭффективныеЧасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭффективныеЧасы[Индекс-1]); 
	    НоваяСтрока.Реализация = Неопределено;
		НоваяСтрока.ЭффективныеЧасы = ОсталисьЭффективныеЧасы;
		ЭффективныеЧасы.Сдвинуть(НоваяСтрока, -1);
		Возврат;
	ИначеЕсли МожноРаспределить > 0 Тогда
		Если Индекс >= ЭффективныеЧасы.Количество() Тогда
			Возврат;
		КонецЕсли;
		ЦБР_РаспределитьЧасы(ЭффективныеЧасы, СтрокаРеализация, Индекс, СтруктураПараметры, МожноРаспределить);
	ИначеЕсли СтруктураПараметры.ОсталосьРаспределить > 0 Тогда
		НоваяСтрока = ЭффективныеЧасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭффективныеЧасы[Индекс-1], "ПериодЗП, Исполнитель");
		НоваяСтрока.ЭффективныеЧасы = СтруктураПараметры.ОсталосьРаспределить; 
	ИначеЕсли ОсталисьЭффективныеЧасы > 0 Тогда
		НоваяСтрока = ЭффективныеЧасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭффективныеЧасы[Индекс-1], "ПериодЗП, Исполнитель");
		НоваяСтрока.ЭффективныеЧасы = ОсталисьЭффективныеЧасы; 
	КонецЕсли;  
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РаспределитьЧасы(ЭффективныеЧасы, СтрокаРеализация, Индекс, ОсталосьРаспределить, МожноРаспределить);
	
	СтрокаРаспределения = ЭффективныеЧасы[Индекс];  
	
	Если СтрокаРаспределения.ВидЧаса <> СтрокаРеализация.ВидЧаса Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СтрокаРаспределения.Реализация) Тогда
		Индекс = Индекс+1;
		РаспределитьЧасы(ЭффективныеЧасы, СтрокаРеализация, Индекс, ОсталосьРаспределить, МожноРаспределить);
		Возврат;
	КонецЕсли;
	
	ОсталосьРаспределить = СтрокаРаспределения.ЭффективныеЧасы;
	СтрокаРаспределения.ЭффективныеЧасы = ?(?(МожноРаспределить>0, МожноРаспределить, СтрокаРеализация.ЧасыОстаток) >= ОсталосьРаспределить, ОсталосьРаспределить, ?(МожноРаспределить>0, МожноРаспределить, СтрокаРеализация.ЧасыОстаток));
	ОсталосьРаспределить = ОсталосьРаспределить - СтрокаРаспределения.ЭффективныеЧасы;
	МожноРаспределить = ?(МожноРаспределить>0,МожноРаспределить,СтрокаРеализация.ЧасыОстаток) - СтрокаРаспределения.ЭффективныеЧасы;

	СтрокаРаспределения.Реализация = СтрокаРеализация.Реализация;
	СтрокаРаспределения.ВидЧаса    = СтрокаРеализация.ВидЧаса;

	Индекс = Индекс+1;  
		
	Если ОсталосьРаспределить > 0 И МожноРаспределить > 0 Тогда
		НоваяСтрока = ЭффективныеЧасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭффективныеЧасы[Индекс-1]);
		НоваяСтрока.ЭффективныеЧасы = ОсталосьРаспределить;
		ЭффективныеЧасы.Сдвинуть(НоваяСтрока, -1);
		Возврат;
	ИначеЕсли МожноРаспределить > 0 Тогда
		Если Индекс >= ЭффективныеЧасы.Количество() Тогда
			Возврат;
		КонецЕсли;
		РаспределитьЧасы(ЭффективныеЧасы, СтрокаРеализация, Индекс, ОсталосьРаспределить, МожноРаспределить);
	ИначеЕсли ОсталосьРаспределить > 0 Тогда
		НоваяСтрока = ЭффективныеЧасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭффективныеЧасы[Индекс-1], "Дата, Комментарий, Исполнитель");
		НоваяСтрока.ЭффективныеЧасы = ОсталосьРаспределить;
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуРеализаций(Партнер = Неопределено)
	
	ТаблицаРеализаций.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦБР_ЧасыКлиентовОстаткиИОбороты.Акт КАК Реализация,
	|	ЦБР_ЧасыКлиентовОстаткиИОбороты.ВидЧаса КАК ВидЧаса,
	|	ЦБР_ЧасыКлиентовОстаткиИОбороты.ЧасыОстаток КАК ЧасыОстаток,
	|	ЛОЖЬ КАК Выбрана,
	|	ЦБР_ЧасыКлиентовОстаткиИОбороты.Акт.Дата КАК АктДата
	|ИЗ
	|	РегистрНакопления.ЦБР_ЧасыКлиентов.Остатки(, Контрагент.Партнер = &Партнер) КАК ЦБР_ЧасыКлиентовОстаткиИОбороты
	|ГДЕ
	|	ЦБР_ЧасыКлиентовОстаткиИОбороты.ЧасыОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктДата"
	;
	Запрос.УстановитьПараметр("Партнер", Партнер);  
	
	ТаблицаРеализаций.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьНаДвеСтроки(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоЗадач.ТекущиеДанные;
	
	Если ТекущаяСтрока.Задание <> ПредопределенноеЗначение("Документ.ЦБР_Задание.ПустаяСсылка") Тогда 
		
		СтруктураТекущихДанных = Новый Структура();
		СтруктураТекущихДанных.Вставить("БесплатныеЧасы", ТекущаяСтрока.Бесплатные);
		СтруктураТекущихДанных.Вставить("ПлатныеЧасы", ТекущаяСтрока.Эффективные);
		СтруктураТекущихДанных.Вставить("ИТСЧасы", ТекущаяСтрока.ИТС);
		СтруктураТекущихДанных.Вставить("ЧасыУстановки", ТекущаяСтрока.Установочные);
		
		ОписаниеОповещенияПослеЗаполнения = Новый ОписаниеОповещения("РазделитьЧасыВРеализацииЗавершение", ЭтотОбъект);
		ОткрытьФорму("Обработка.ЦБР_АРМПрикрепленияРеализаций.Форма.ФормаРазделенияЧасов", СтруктураТекущихДанных, ЭтаФорма,,,, ОписаниеОповещенияПослеЗаполнения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаСчетКомпании(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоЗадач.ТекущиеДанные;
	
	Если ТекущаяСтрока.Задание <> ПредопределенноеЗначение("Документ.ЦБР_Задание.ПустаяСсылка") Тогда
		УстановитьЗаСчетКомпанииНаСервере(ТекущаяСтрока.Задание, ТекущаяСтрока.Эффективные, ТекущаяСтрока.ПериодЗП); 
	КонецЕсли;  
	
	ОбновитьДеревоЗадач();
	ОбновитьТаблицуРеализаций();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаСчетКомпанииНаСервере(Задание, Эффективные, ПериодЗП)
	
	ОбъектЗадания = Задание.ПолучитьОбъект();	
	
	ОсталосьРаспределить = Эффективные;
	
	Для Каждого Стр Из ОбъектЗадания.ЧасыЗП Цикл
		
		Если ОсталосьРаспределить <= 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.Реализация) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.ПериодЗП <> ПериодЗП Тогда
			Прервать;
		КонецЕсли;
		
		Если Стр.ВидЧаса = Перечисления.ЦБР_ВидыЧасовПоЗадачам.Платные Тогда
			Если Стр.ЭффективныеЧасы > ОсталосьРаспределить Тогда
				НоваяСтр = ОбъектЗадания.ЧасыЗП.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр,Стр);
				НоваяСтр.ЭффективныеЧасы = ОсталосьРаспределить;
				НоваяСтр.ЗаСчетКомпании  = Истина;
				Стр.ЭффективныеЧасы      = Стр.ЭффективныеЧасы - ОсталосьРаспределить;
				ОсталосьРаспределить     = 0;
            ИначеЕсли Стр.ЭффективныеЧасы <= ОсталосьРаспределить Тогда
				Стр.ЗаСчетКомпании       = Истина;
				ОсталосьРаспределить     = ОсталосьРаспределить - Стр.ЭффективныеЧасы;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	ОбъектЗадания.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделитьЧасыВРеализацииЗавершение(Результат, ДопПараметры) Экспорт
		
	Если Результат <> Неопределено Тогда  
		НужнаНоваяСтрока = Ложь;
		ТекущаяСтрока = Элементы.ДеревоЗадач.ТекущиеДанные;
		Если Результат.БесплатныеЧасы <> 0 Тогда
			ТекущаяСтрока.Бесплатные = ТекущаяСтрока.Бесплатные - Результат.БесплатныеЧасы;
			НужнаНоваяСтрока = Истина; 
		КонецЕсли;
		Если Результат.ПлатныеЧасы <> 0 Тогда
			ТекущаяСтрока.Эффективные = ТекущаяСтрока.Эффективные - Результат.ПлатныеЧасы;
			НужнаНоваяСтрока = Истина; 
		КонецЕсли;
		Если Результат.ИТСЧасы <> 0 Тогда
			ТекущаяСтрока.ИТС = ТекущаяСтрока.ИТС - Результат.ИТСЧасы;
			НужнаНоваяСтрока = Истина; 
		КонецЕсли;
		Если Результат.ЧасыУстановки <> 0 Тогда
			ТекущаяСтрока.Установочные = ТекущаяСтрока.Установочные - Результат.ЧасыУстановки;
			НужнаНоваяСтрока = Истина; 
		КонецЕсли;  
		Если НужнаНоваяСтрока Тогда
			ИдентификаторСтроки = Элементы.ДеревоЗадач.ТекущаяСтрока;
			ТекущаяСтрока       = ДеревоЗадач.НайтиПоИдентификатору(ИдентификаторСтроки);
			СтрокаРодитель      = ТекущаяСтрока.ПолучитьРодителя();
			НоваяСтрокаДерева   = СтрокаРодитель.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, ТекущаяСтрока);  
			НоваяСтрокаДерева.Бесплатные   = Результат.БесплатныеЧасы;
			НоваяСтрокаДерева.Эффективные  = Результат.ПлатныеЧасы;
			НоваяСтрокаДерева.ИТС          = Результат.ИТСЧасы;
			НоваяСтрокаДерева.Установочные = Результат.ЧасыУстановки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
